Былков_ДА_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностей/ВедомостьУчетаАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.СтатусыАкадемическихЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УчетАкадемическихЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/InformationRegisters/СтатусыАкадемическихЗадолженностей/СтатусыАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыАкадемическихЗадолженностей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>СтатусЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Былков_ДА_70180166/src/InformationRegisters/ОценкиСтудентов/ОценкиСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОценкиСтудентов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Былков_ДА_70180166/src/AccumulationRegisters/УчетАкадемическихЗадолженностей/УчетАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетАкадемическихЗадолженностей</name>
  <resources>
    <name>КоличествоПросроченныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Былков_ДА_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.СтатусыАкадемическихЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УчетАкадемическихЗадолженностей</registerRecords>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаКонтроля</name>
    <type>
      <types>EnumRef.ФормаКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</types>
    </type>
  </attributes>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/ВедомостьУчетаАкадемическихЗадолженностей/ObjectModule.bsl
&НаСервере
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
    
    Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей") Тогда
        
        // Получаем объект приказа
        Приказ = ДанныеЗаполнения.ПолучитьОбъект();
        
        // Проверяем тип документа-основания
        Если Не Приказ.ДокументОснование.Метаданные().Имя = "НаправлениеНаПересдачу" Тогда
            ВызватьИсключение "Для данной ведомости документом-основанием должно быть «Направление на пересдачу»!";
        КонецЕсли;
        
        // Заполняем реквизиты шапки документа
        ЭтотОбъект.Студент = Приказ.Студент;
        ЭтотОбъект.Преподаватель = Приказ.Преподаватель;
        ЭтотОбъект.Дисциплина = Приказ.Дисциплина;
        ЭтотОбъект.Основание = ДанныеЗаполнения.Ссылка;

        // Получаем наименование контроля для данной дисциплины
        ФормаКонтроля = Неопределено;
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    Дисциплины.ФормаКонтроля КАК ФормаКонтроля
        |ИЗ
        |    Справочник.Дисциплины КАК Дисциплины
        |ГДЕ
        |    Дисциплины.Ссылка = &Дисциплина";
        
        Запрос.УстановитьПараметр("Дисциплина", ЭтотОбъект.Дисциплина);
        Результат = Запрос.Выполнить();
        
        Если Не Результат.Пустой() Тогда
            Выборка = Результат.Выбрать();
            Если Выборка.Следующий() Тогда
                ФормаКонтроля = Выборка.ФормаКонтроля;
            КонецЕсли;
        КонецЕсли;
        
        // Заполняем наименование контроля в шапке
        Если ЗначениеЗаполнено(ФормаКонтроля) Тогда
            ЭтотОбъект.ФормаКонтроля = ФормаКонтроля;
		КонецЕсли; 
		
		 // Проверка уникальности ведомости
        ПроверитьУникальностьВедомости(ДанныеЗаполнения.Студент, ДанныеЗаполнения.Дисциплина, "", ДанныеЗаполнения.Ссылка);

        
    КонецЕсли;
          
КонецПроцедуры 

&НаСервере
Процедура ПроверитьУникальностьВедомости(Студент, Дисциплина, ИмяСтудента = "", ДокументОснование)
    
    // Получаем имя студента, если передан студент
    Если ЗначениеЗаполнено(Студент) Тогда
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    Студенты.Наименование КАК Наименование
        |ИЗ
        |    Справочник.Студенты КАК Студенты
        |ГДЕ
        |    Студенты.Ссылка = &СсылкаНаСтудента";
        
        Запрос.УстановитьПараметр("СсылкаНаСтудента", Студент);
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        
        Если Выборка.Следующий() Тогда
            ИмяСтудента = Выборка.Наименование;
        КонецЕсли;
	КонецЕсли;
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВедомостьУчетаАкадемическихЗадолженностей.Ссылка КАК Ссылка,
    |    ВедомостьУчетаАкадемическихЗадолженностей.Дата КАК Дата,
    |    ВедомостьУчетаАкадемическихЗадолженностей.Номер КАК Номер,
    |    ВедомостьУчетаАкадемическихЗадолженностей.Основание КАК Основание
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностей КАК ВедомостьУчетаАкадемическихЗадолженностей
    |ГДЕ
    |    ВедомостьУчетаАкадемическихЗадолженностей.Студент = &Студент
    |    И ВедомостьУчетаАкадемическихЗадолженностей.Дисциплина = &Дисциплина
    |    И ВедомостьУчетаАкадемическихЗадолженностей.ПометкаУдаления = ЛОЖЬ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Дисциплина", Дисциплина);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();

   Если Выборка.Количество() > 0 Тогда
            ВызватьИсключение ("Для студента «" + Студент +"» уже существует документ «Ведомость учета академических задолженностей» по дисциплине «"+Дисциплина+ "»!");
        КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
    
    // Проверяем, есть ли уже проведенная ведомость для ИОМ по этому студенту и дисциплине
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Ссылка КАК Ссылка
    |ИЗ
    |    Документ.ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ КАК ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ
    |ГДЕ
    |    ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Проведен
    |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Студент = &Студент
    |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.Дисциплина = &Дисциплина
    |    И ВедомостьУчетаАкадемическихЗадолженностейДляСтудентовсИОМ.ФормаКонтроля = &ФормаКонтроля";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Дисциплина", Дисциплина);
    Запрос.УстановитьПараметр("ФормаКонтроля", ФормаКонтроля);
    
    Результат = Запрос.Выполнить();
    
    Если Не Результат.Пустой() Тогда
        Отказ = Истина;
        ВызватьИсключение "Для студента «"+Студент+ "» уже существует проведенная «Ведомость учета академических задолженностей для студентов с ИОМ»!";
        Возврат;
    КонецЕсли;
    
    // Регистр СтатусыАкадемическихЗадолженностей
    Движения.СтатусыАкадемическихЗадолженностей.Записывать = Истина;
    Движение = Движения.СтатусыАкадемическихЗадолженностей.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Дисциплина = Дисциплина;
    Движение.СтатусЗадолженности = СтатусАкадемическойЗадолженности;
    
    // Регистр ОценкиСтудентов
    Движения.ОценкиСтудентов.Записывать = Истина;
    Движение = Движения.ОценкиСтудентов.Добавить();
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Дисциплина = Дисциплина;
    Движение.ФормаКонтроля = ФормаКонтроля;
    Движение.Оценка = Оценка; 
    
    // Регистр УчетАкадемическихЗадолженностей
    Движения.УчетАкадемическихЗадолженностей.Записывать = Истина;
    Движение = Движения.УчетАкадемическихЗадолженностей.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Студент = Студент;
    Движение.Дисциплина = Дисциплина;
    Движение.ФормаКонтроля = ФормаКонтроля;
    Движение.КоличествоПросроченныхЗадолженностей = 1; // Каждая ведомость = 1 задолженность
       
КонецПроцедуры
